#+startup: overview inlineimages indent hideblocks
#+options: toc:nil num:nil
#+property: header-args:python :results output :session *Python* :exports both :noweb yes
**** Creativity

- Create a function ~hello~ that says "Hi, [yourname]":
  #+begin_src python :results silent
    def hello():
        print("Hi, Marcus")
  #+end_src

- Call the function.
  #+begin_src python
    hello()
  #+end_src

  #+RESULTS:
  : Hi, Marcus

- Modify the function and rename it to ~hello_name~: add ~name~ as an
  argument, and print ~name~. Call the function with different names.
  #+begin_src python
    def hello_name(name):
        print(name)
        return

    hello_name("Marcus")
    hello_name("Jane")
    hello_name("John")
  #+end_src

  #+RESULTS:
  : Marcus
  : Jane
  : John

- Add a conditional to the function and rename it to ~hello_if~: print
  the name only if it begins with the letter ~'J'~.
  #+begin_src python
    def hello_if(name):
        if name[0]=='J':
            print(name)
        return

    hello_if("Marcus")
    hello_if("Jane")
    hello_if("John")
  #+end_src

  #+RESULTS:
  : Jane
  : John

- Add a loop to the function and rename it to ~hello_for~:
  1) Change the argument to ~name_list~.
  2) Loop over ~name_list~ and greet each name with "hello".
  3) Outside the function, before calling it, define a list of names
     ~name_list~ with the names "Saige","Lou","Ethan","Loren".
  4) Call the function with the argument ~name_list~.
  #+begin_src python
    def hello_for(name_list):
        for name in name_list:
            print("Hello,", name)
        return

    name_list = ["Saige","Lou","Ethan","Loren"]
    hello_for(name_list)
  #+end_src

  #+RESULTS:
  : Hello, Saige
  : Hello, Lou
  : Hello, Ethan
  : Hello, Loren

*** Reviewing test 2

- In the statement ~x = 1~,
  1) ~x~ is an integer variable (naming conventions apply)
  2) ~=~ is an assignment operator (assigns RHS to LHS)
  3) ~1~ is a numeric value (integer or ~int~ data type)

- In the statement ~name = "Joe"~,
  1) ~name~ is a string variable
  2) ~=~ is an assignment operator (assigns RHS to LHS)
  3) ~"Marcus"~ is a string of six characters
  4) Once assigned, ~name[0]~ is ~'J'~ etc.
     #+begin_src python
       name = 'Joe'
       for i in name: print(i)
     #+end_src

     #+RESULTS:
     : J
     : o
     : e

- Logical operators result in Boolean values (~True~ or ~False~):
  #+begin_src python
    x = 1   # store 1 in x
    print(x == 1)  # output: True because x = 1
    print(x > 1)   # output: False because x is not greater than 1
    print(x >= 1)  # output: True because x is greater or equal than 1
    print(x != 1)  # output: False because x = 1
  #+end_src

- Question: can you assign all values EXCEPT 1 to a variable?
  #+begin_quote
  You can use unpacking to assign all values in a list to variables,
  and you can use ~*~ to assign all values except some to a variable as
  a list:
  #+end_quote
  #+begin_src python
    numbers = [1,2,3,4,5]
    first, *rest = numbers
    print(first, rest)
    print(numbers[1:-1])
  #+end_src

  #+RESULTS:
  : 1 [2, 3, 4, 5]
  : [2, 3, 4]

*** Review Python lists - Preview Test 4

We're going to review [[https://campus.datacamp.com/courses/intro-to-python-for-data-science/chapter-2-python-lists?ex=1][Chapter 2 - Python Lists]] - you'll find some of
this (only the =list= stuff) in test 4, which will be available
tomorrow (Tue 3-Oct) for you to complete:
1. Creating and printing lists (as comprehensions)
2. Subsetting and slicing lists
3. Replacing and extending lists

-----

1) Make a =list= named ~fam~ of your family members that includes everybody's
   name followed by their age, and print it:
   #+begin_src python
     fam = ['Marcus', 59,
            'Carlye', 64,
            'Lucia', 22]
     print(fam)
   #+end_src

   #+RESULTS:
   : ['Marcus', 59, 'Carlye', 64, 'Lucia', 22]

2) Make another =list= named ~fam2~ with the same information but this time
   each family member and their age is a list item. So if you have 3
   family members, ~fam~ had 6 elements but ~fam2~ has only 3:
   #+begin_src python
     fam2 = [['Marcus', 59],
             ['Carlye', 64],
             ['Lucia', 22]]
     print(fam2)
   #+end_src

   #+RESULTS:
   : [['Marcus', 59], ['Carlye', 64], ['Lucia', 22]]

3) You can print lists as /comprehensions/, too, where ~foo~ is a (dummy)
   counter variable, and ~bar~ is a =list=:
   #+begin_src python
     [print(foo) for foo in bar]
   #+end_src
   Do this for both ~fam~ and ~fam2~ now:
   #+begin_src python
     [print(i) for i in fam]
     [print(i) for i in fam2]
   #+end_src

   #+RESULTS:
   : Marcus
   : 59
   : Carlye
   : 64
   : Lucia
   : 22
   : ['Marcus', 59]
   : ['Carlye', 64]
   : ['Lucia', 22]

4) Print only the names of ~fam2~ using the index operator =[]=:
   #+begin_src python
     print(fam2[0][0],fam2[1][0],fam2[2][0])
   #+end_src

   #+RESULTS:
   : Marcus Carlye Lucia

5) Print only the ages of the family members of ~fam2~:
   #+begin_src python
     print(fam2[0][1],fam2[1][1],fam2[2][1])
   #+end_src

   #+RESULTS:
   : 59 64 22

6) Use /slicing/ to print the last two elements of ~fam~ (there are two
   ways to do this). Remember that the first index before the slicing
   operator is the start, which is included, and the second index is
   the end, which is not included. Confusing!
   #+begin_src python
     print(fam)
     print(fam[4:])  # from 4 to end
     print(fam[4:6]) # from 4 to 6 (which does not exist)
     print(fam[6]) # Output: IndexError 'index out of range'
   #+end_src

   #+RESULTS:
   : ['Marcus', 59, 'Carlye', 64, 'Lucia', 22]
   : ['Lucia', 22]
   : ['Lucia', 22]

7) Print the last element of ~fam~ (there are two ways):
   #+begin_src python
     print(fam[-1])
     print(fam[5])
   #+end_src

   #+RESULTS:
   : 22
   : 22

8) Your name elements are probable in title or lower case. You can use
   =str.upper= to turn a string into upper case characters:
   #+begin_src python
     print("Marcus".upper())
   #+end_src
   Change the last name of your =list= ~fam~ to upper case, then print
   ~fam~.
   #+begin_src python
     print(fam)
     print(fam[4].upper())
     fam[4] = fam[4].upper()
     print(fam)
   #+end_src

   #+RESULTS:
   : ['Marcus', 59, 'Carlye', 64, 'Lucia', 22]
   : LUCIA
   : ['Marcus', 59, 'Carlye', 64, 'LUCIA', 22]

9) Turn the last element of your list into a string:
   #+begin_src python
     fam[-1] = str(fam[-1])
     print(fam)
   #+end_src

   #+RESULTS:
   : ['Marcus', 59, 'Carlye', 64, 'LUCIA', '22']

10) Assume you get a cat named "Millie". She is 3 years old. Add her
    data to ~fam~:
    #+begin_src python
      fam = fam + ['Millie', 3]
      print(fam)
    #+end_src

    #+RESULTS:
    : ['Marcus', 59, 'Carlye', 64, 'LUCIA', '22', 'Millie', 3]

11) You give your cat Millie to a friend who is lonely. Remove her
    data from the =list= ~fam~, then print it.
    #+begin_src python
      del(fam[6:])  # this will apply to fam immediately!
      print(fam)
    #+end_src

    #+RESULTS:
    : ['Marcus', 59, 'Carlye', 64, 'LUCIA', '22']

12) What is ~foo~ at the end of the following code block? Remember that
    lists are references to computer memory locations.
    #+begin_src python
      foo = [1,2,3]
      bar = foo
      bar[2:4] = [5,6]
      print(bar)
    #+end_src

    #+RESULTS:
    : [1, 2, 5, 6]

13) When copying ~foo~ into ~bar~ and then changing ~bar~ as before, how can
    you keep ~foo~ unchanged?
    #+begin_src python
      foo = [1,2,3]
      bar = list(foo)  # copies foo values into bar
      bar[2:4] = [5,6]
      print(f'bar: {bar}\nfoo: {foo}')
    #+end_src

    #+RESULTS:
    : bar: [1, 2, 5, 6]
    : foo: [1, 2, 3]

*** Preview of dictionaries, tuples and comprehensions

Here is a preview on even more data structures besides =list=, namely
=dictionary= and =tuple=:

1) Make a =list= of names ~course~ (class mates) and print it.
   #+begin_src python
     course = ["Saige", "Ethan", "Lou", "Loren"]
     print(course)
   #+end_src

   #+RESULTS:
   : ['Saige', 'Ethan', 'Lou', 'Loren']

2) The ~areas~ list from DataCamp can also be encoded as a Python
   =dictionary= (another data structure):
   #+begin_src python
     ## define variables
     hall = 11.25
     kit = 18.0
     liv = 20.0
     bed = 10.75
     bath = 9.50
     ## define dictionary of key: value pairs
     areas = {
         "hallway": hall,
         "kitchen": kit,
         "living room": liv,
         "bedroom": bed,
         "bathroom": bath}
     ## print the dictionary
     print(areas)
   #+end_src

   #+RESULTS:
   : {'hallway': 11.25, 'kitchen': 18.0, 'living room': 20.0, 'bedroom': 10.75, 'bathroom': 9.5}

3) Your turn! Make a dictionary of class mates ~course_dict~ with their
   name as key and their sex and age as values. For the key, use the
   relevant ~course~ =list= item:
   #+begin_src python
     course_dict = {
         course[0]: ["male",17],
         course[1]: ["male",17],
         course[2]: ["female",17],
         course[3]: ["female",17]
     }
     print(course_dict)
   #+end_src

   #+RESULTS:
   : {'Saige': ['male', 17], 'Ethan': ['male', 17], 'Lou': ['female', 17], 'Loren': ['female', 17]}

4) You can also print the list as a =for= loop:
   #+begin_src python
     for key, value in areas.items():
         print(f'Key: {key}, value: {value}')
   #+end_src

   #+RESULTS:
   : Key: hallway, value: 11.25
   : Key: kitchen, value: 18.0
   : Key: living room, value: 20.0
   : Key: bedroom, value: 10.75
   : Key: bathroom, value: 9.5

5) You turn! Print ~course_dict~ as a =for= loop!
   #+begin_src python
     for key, value in course_dict.items():
         print(f'Key: {key}, value: {value}')
   #+end_src

   #+RESULTS:
   : Key: Saige, value: ['male', 17]
   : Key: Ethan, value: ['male', 17]
   : Key: Lou, value: ['female', 17]
   : Key: Loren, value: ['female', 17]

6) You can also print this with a /comprehension/, a way of running a
   function with a loop and defining a data structure in one line:
   #+begin_src python
     output = [print(key,value) for key, value in areas.items()]
   #+end_src

   #+RESULTS:
   : hallway 11.25
   : kitchen 18.0
   : living room 20.0
   : bedroom 10.75
   : bathroom 9.5

7) Given the =list= ~course~ from earlier, how would you print the items
   line by line using a comprehension? This time you do not need
   =items=. The general format of a list comprehension is:
   #+begin_example python
     [ function(arg) for arg in list ]
   #+end_example
   Try that for the ~course~ =list=:
   #+begin_src python
     [print(name) for name in course]
   #+end_src

   #+RESULTS:
   : Saige
   : Ethan
   : Lou
   : Loren

8) Now, turn the dictionary ~areas~ into a =list= using the =list= function,
   then print it as a =list= comprehension:
   #+begin_src python
     areas_list = list(areas.items())
     [print(item) for item in areas_list]
   #+end_src

   #+RESULTS:
   : ('hallway', 11.25)
   : ('kitchen', 18.0)
   : ('living room', 20.0)
   : ('bedroom', 10.75)
   : ('bathroom', 9.5)

9) Notice the character of the =list= elements: they are tuples (ordered
   pairs of values) which you can check by checking the =type= of any
   element:
   #+begin_src python
     print(type(areas_list[0]))
   #+end_src

   #+RESULTS:
   : <class 'tuple'>

10) Since the =dictionary= has two types of elements, keys and values,
    you can put them into separate lists if you want:
    #+begin_src python
      areas_list_keys = areas.keys()
      print(areas_list_keys)
      areas_list_values = areas.values()
      print(areas_list_values)
    #+end_src

    #+RESULTS:
    : dict_keys(['hallway', 'kitchen', 'living room', 'bedroom', 'bathroom'])
    : dict_values([11.25, 18.0, 20.0, 10.75, 9.5])

*** Preview: test 5 (Thursday)

For answers and code examples, see ~notebook.ipynb~ in [[https://app.datacamp.com/workspace/w/f87132bd-3262-4a0f-bbd8-cbbc8222b00a/edit][this workspace]].

- What's a function?
- How can you get help?
- What are function arguments and parameters?
- What's a method in Python, and are methods functions?
- Use a method to sort elements of a list.
  #+begin_src python
    foo = ["Saige", "Lou", "Ethan", "Loren"]
    print(foo)
    foo.sort()  # sorts the list 'in place'
    print(foo)
  #+end_src

  #+RESULTS:
  : ['Saige', 'Lou', 'Ethan', 'Loren']
  : ['Ethan', 'Loren', 'Lou', 'Saige']
- What's a package in Python?
- How can you import a package or module or function?
- What data type is the output of the function =max=?
- How many arguments do you have to supply to =round=?
- What does the =index= function do?
  #+begin_src python
    print(foo)
    print(foo.index('Lou'))
  #+end_src

  #+RESULTS:
  : ['Ethan', 'Loren', 'Lou', 'Saige']
  : 2

** Test preview / review =NumPy= library (DataCamp)

1) What do you need to do to use ~np.array~ instead of ~numpy.array~?
   #+begin_src python
     import numpy as np
     docstring = np.array.__doc__
     print(docstring)
   #+end_src
2) What is the output of this code?
   #+begin_src python
     import numpy as np
     print(help(numpy.array))
   #+end_src
   #+begin_quote
   ~NameError~: name 'numpy' not defined.
   #+end_quote
3) ~array~ is a function in ~numpy~. Use it on a list ~[1,2,3]~.
   #+begin_src python
     import numpy
     print(numpy.array([1,2,3]))
   #+end_src
4) What can you do with NumPy arrays that lists cannot do?
   #+begin_src python
     # Vectorization
     foo = [1,2,3]
     print(foo * 4)
     print(np.array(foo)*4)
   #+end_src

   #+RESULTS:
   : [1, 2, 3, 1, 2, 3, 1, 2, 3, 1, 2, 3]
   : [ 4  8 12]
5) How many data types can a list have? How many can an array have?
   #+begin_src python
     foo = ["me", 1, True]
     print(foo, type(foo))
     print(np.array(foo))
   #+end_src

   #+RESULTS:
   : ['me', 1, True] <class 'list'>
   : ['me' '1' 'True']
6) How can you extract all array items in [5,10)?
   #+begin_src python
     foo = np.array([0,1,2,5,8,10,11,12])
   #+end_src
   Solution:
   #+begin_src python
     print(foo)
     print((foo >= 5) & (foo < 10))
     bar = (foo >= 5) & (foo < 10)
     print(foo[bar])
     print(foo[~bar]) # ~ inverts the condition: not in [5,10)

   #+end_src

   #+RESULTS:
   : [ 0  1  2  5  8 10 11 12]
   : [False False False  True  True False False False]
   : [5 8]
   : [ 0  1  2 10 11 12]
7) Can you put ~['Joe','Jim','Jane']~ and ~[1.8,1.92,1.74]~ in a NumPy
   array?
   #+begin_src python
     name = ['Joe','Jim','Jane']
     height = [1.8, 1.92, 1.74]
     np_name_height = np.array([name,height])
     print(np_name_height)
     print(type(np_name_height))
   #+end_src

   #+RESULTS:
   : [['Joe' 'Jim' 'Jane']
   :  ['1.8' '1.92' '1.74']]
   : <class 'numpy.ndarray'>
8) Consider this 2D array - how can you extract the element ~1.92~?
   #+begin_src python
     weight = [179.,210.,140.]
     height = [1.8, 1.92, 1.74]
     np_weight_height = np.array([weight,height])
     print(np_weight_height)
   #+end_src

   #+RESULTS:
   : [[179.   210.   140.  ]
   :  [  1.8    1.92   1.74]]

   Solution:
   #+begin_src python
     print(np_weight_height[1,1])
   #+end_src

   #+RESULTS:
   : 1.92
9) What does the =:= operator do in NumPy arrays?
   #+begin_src python
     print(foo)
     print(foo[:]) # all elements
     print(foo[:-1])  # all except the last element
     print(foo[3:5])  # elements foo[3], foo[4] but not foo[5]
   #+end_src

   #+RESULTS:
   : [ 0  1  2  5  8 10 11 12]
   : [ 0  1  2  5  8 10 11 12]
   : [ 0  1  2  5  8 10 11]
   : [5 8]
10) Compute the arithmetic average of ~np_weight_height~ over both
    dimensions of the matrix:
    #+begin_src python
      print(np_weight_height[0,])
      print(np_weight_height[1,])      
      print(np.mean(np_weight_height[0,]))
      print(np.mean(np_weight_height[1,]))     
    #+end_src

    #+RESULTS:
    : [179. 210. 140.]
    : [1.8  1.92 1.74]
    : 176.33333333333334
    : 1.82

-----
Note: There is a whole course on =NumPy= [[https://app.datacamp.com/learn/courses/introduction-to-numpy][at DataCamp]] (intermediate+)



